%--------------------------------------------------------------------------
%  examp8.2-1  调用anova2函数作双因素一元方差分析
%--------------------------------------------------------------------------
% CopyRight：xiezhh

% 定义一个矩阵，输入原始数据
yield = [38	29	36	40
         45	42	37	43
         58	46	52	51
         67	70	65	71
         62	64	61	70
         58	63	71	69];
yield = yield';  % 矩阵转置
% 将数据矩阵yield转换成8行3列的矩阵，列对应因素A（氮），行对应因素B（磷）
yield = [yield(:,[1,3,5]);yield(:,[2,4,6])];

top = {'因素','N1','N2','N3'};
left = {'P1';'P1';'P1';'P1';'P2';'P2';'P2';'P2'};
[top;left,num2cell(yield)]  % 显示数据

% 调用anova2函数作双因素方差分析
[p,table,stats] = anova2(yield, 4)

% 对列（因素A）进行多重比较
[c_A,m_A] = multcompare(stats,'estimate','column')
% 对行（因素B）进行多重比较
[c_B,m_B] = multcompare(stats,'estimate','row')