%--------------------------------------------------------------------------
%                    调用xlswrite函数写数据到文件
%--------------------------------------------------------------------------
% CopyRight：xiezhh

x = rand(10);
[s,t] = xlswrite('examp02_15.xls', x, 2, 'D6:M15')

x = {1,60101,6010101,'陈亮',63,'';2,60101,6010102,'李旭',73,'';3,60101,...
6010103,'刘鹏飞',0,'缺考'}
xlswrite('examp02_15.xls', x, 'xiezhh', 'A3:F5')

num = xlsread('examp02_14.xls');
xlswrite('examp02_15.xls', num, '成绩')