%--------------------------------------------------------------------------
%  examp10.2-2  读取examp10_2_2.xls中数据，进行变量系统聚类
%--------------------------------------------------------------------------
% CopyRight：xiezhh

%*************************读取数据，并转为距离向量***************************
[X,textdata] = xlsread('examp10_2_2.xls');
% y = 1 - X(X~=1 & ~isnan(X))'
y = 1 - X(tril(true(size(X)),-1))'

%***********************调用linkage函数创建系统聚类树************************
Z = linkage(y,'average')


%****************************** 绘制聚类树形图 *****************************
varlabel = textdata(2:end,1);
H = dendrogram(Z,0,'orientation','right','labels',varlabel);
set(H,'LineWidth',2,'Color','k');
xlabel('并类距离（类平均法）')