%--------------------------------------------------------------------------
%  examp10.4-1  读取examp10_4_1.xls中数据，进行模糊C均值聚类
%--------------------------------------------------------------------------
% CopyRight：xiezhh

%*************************读取数据，并进行标准化变换*************************
[xdata,textdata] = xlsread('examp10_4_1.xls');
city = textdata(4:end,1);
X = zscore(xdata);


%****************************进行模糊C均值聚类******************************
options = [3, 200, 1e-6, 0];
[center,U,obj_fcn] = fcm(X,3,options)


%******************************查看聚类结果*********************************
id1 = find(U(1,:) == max(U));
id2 = find(U(2,:) == max(U));
id3 = find(U(3,:) == max(U));
city(id1)
city(id2)
city(id3)
